<form>
  <label>DDoS Investigations</label>
  <description>See portal for connction per seconds and random early drop rules
We are configured for classified which means it counts per device.</description>
  <fieldset submitButton="true" autoRun="true">
    <input type="time" token="tkn_time" searchWhenChanged="true">
      <label>Time Window</label>
      <default>
        <earliest>-8h@h</earliest>
        <latest>now</latest>
      </default>
    </input>
    <input type="text" token="ip_token" searchWhenChanged="true">
      <label>IP to investigate</label>
      <default>*</default>
      <initialValue>*</initialValue>
    </input>
  </fieldset>
  <row>
    <panel>
      <title>DDoS attack orginations</title>
      <table>
        <title>sourcetype=pan* AND threat_name="UDP Flood" OR threat_name="TCP Flood" $ip_token$ | stats count by client_location  | sort -count</title>
        <search>
          <query>sourcetype=pan* AND threat_name="UDP Flood" OR threat_name="TCP Flood" $ip_token$
| stats count by client_location 
| sort -count</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="count">10</option>
        <option name="dataOverlayMode">none</option>
        <option name="drilldown">none</option>
        <option name="percentagesRow">false</option>
        <option name="rowNumbers">false</option>
        <option name="totalsRow">false</option>
        <option name="wrap">true</option>
        <format type="color" field="src_ip">
          <colorPalette type="sharedList"></colorPalette>
          <scale type="sharedCategory"></scale>
        </format>
        <format type="color" field="count">
          <colorPalette type="minMidMax" maxColor="#006D9C" minColor="#FFFFFF"></colorPalette>
          <scale type="minMidMax"></scale>
        </format>
      </table>
    </panel>
    <panel>
      <map>
        <title>sourcetype=pan* AND flood OR FLOOD $ip_token$ | iplocation src_ip | geostats count by Country</title>
        <search>
          <query>sourcetype=pan* AND flood OR FLOOD $ip_token$
| iplocation src_ip | geostats count by Country</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="drilldown">none</option>
        <option name="mapping.choroplethLayer.colorBins">5</option>
        <option name="mapping.choroplethLayer.colorMode">auto</option>
        <option name="mapping.choroplethLayer.maximumColor">0xaf575a</option>
        <option name="mapping.choroplethLayer.minimumColor">0x62b3b2</option>
        <option name="mapping.choroplethLayer.neutralPoint">0</option>
        <option name="mapping.choroplethLayer.shapeOpacity">0.75</option>
        <option name="mapping.choroplethLayer.showBorder">1</option>
        <option name="mapping.data.maxClusters">100</option>
        <option name="mapping.legend.placement">bottomright</option>
        <option name="mapping.map.center">(0,0)</option>
        <option name="mapping.map.panning">1</option>
        <option name="mapping.map.scrollZoom">0</option>
        <option name="mapping.map.zoom">2</option>
        <option name="mapping.markerLayer.markerMaxSize">50</option>
        <option name="mapping.markerLayer.markerMinSize">10</option>
        <option name="mapping.markerLayer.markerOpacity">0.8</option>
        <option name="mapping.showTiles">1</option>
        <option name="mapping.tileLayer.maxZoom">7</option>
        <option name="mapping.tileLayer.minZoom">0</option>
        <option name="mapping.tileLayer.tileOpacity">1</option>
        <option name="mapping.type">marker</option>
        <option name="trellis.enabled">0</option>
        <option name="trellis.scales.shared">1</option>
        <option name="trellis.size">medium</option>
      </map>
    </panel>
  </row>
  <row>
    <panel>
      <chart>
        <title>sourcetype=pan* AND flood OR FLOOD $ip_token$ | timechart count by signature</title>
        <search>
          <query>sourcetype=pan* AND flood OR FLOOD $ip_token$
| timechart count by signature</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="charting.axisLabelsX.majorLabelStyle.overflowMode">ellipsisNone</option>
        <option name="charting.axisLabelsX.majorLabelStyle.rotation">0</option>
        <option name="charting.axisTitleX.visibility">visible</option>
        <option name="charting.axisTitleY.visibility">visible</option>
        <option name="charting.axisTitleY2.visibility">visible</option>
        <option name="charting.axisX.abbreviation">none</option>
        <option name="charting.axisX.scale">linear</option>
        <option name="charting.axisY.abbreviation">none</option>
        <option name="charting.axisY.scale">linear</option>
        <option name="charting.axisY2.abbreviation">none</option>
        <option name="charting.axisY2.enabled">0</option>
        <option name="charting.axisY2.scale">inherit</option>
        <option name="charting.chart">line</option>
        <option name="charting.chart.bubbleMaximumSize">50</option>
        <option name="charting.chart.bubbleMinimumSize">10</option>
        <option name="charting.chart.bubbleSizeBy">area</option>
        <option name="charting.chart.nullValueMode">gaps</option>
        <option name="charting.chart.showDataLabels">none</option>
        <option name="charting.chart.sliceCollapsingThreshold">0.01</option>
        <option name="charting.chart.stackMode">default</option>
        <option name="charting.chart.style">shiny</option>
        <option name="charting.drilldown">none</option>
        <option name="charting.layout.splitSeries">0</option>
        <option name="charting.layout.splitSeries.allowIndependentYRanges">0</option>
        <option name="charting.legend.labelStyle.overflowMode">ellipsisMiddle</option>
        <option name="charting.legend.mode">standard</option>
        <option name="charting.legend.placement">right</option>
        <option name="charting.lineWidth">2</option>
        <option name="refresh.display">progressbar</option>
        <option name="trellis.enabled">0</option>
        <option name="trellis.scales.shared">1</option>
        <option name="trellis.size">medium</option>
      </chart>
    </panel>
  </row>
  <row>
    <panel>
      <table>
        <title>sourcetype=pan* AND flood OR FLOOD $ip_token$ | stats values(dest_ip) by src_ip rule</title>
        <search>
          <query>sourcetype=pan* AND flood OR FLOOD $ip_token$
| stats values(dest_ip) by src_ip rule</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="count">5</option>
        <option name="dataOverlayMode">none</option>
        <option name="drilldown">row</option>
        <option name="percentagesRow">true</option>
        <option name="rowNumbers">false</option>
        <option name="totalsRow">false</option>
        <option name="wrap">true</option>
        <format type="color" field="src_ip">
          <colorPalette type="sharedList"></colorPalette>
          <scale type="sharedCategory"></scale>
        </format>
      </table>
    </panel>
    <panel>
      <title>Possible DDoS</title>
      <table>
        <title>sourcetype=pan:threat threat="*Flood*"  $ip_token$ |  stats count by signature src_ip src_location vendor_action</title>
        <search>
          <query>sourcetype=pan:threat threat="*Flood*"  $ip_token$
|  stats count by signature src_ip src_location vendor_action 
|  sort -count</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="count">10</option>
        <option name="dataOverlayMode">none</option>
        <option name="drilldown">none</option>
        <option name="percentagesRow">false</option>
        <option name="refresh.display">progressbar</option>
        <option name="rowNumbers">true</option>
        <option name="totalsRow">false</option>
        <option name="wrap">true</option>
        <format type="color" field="count">
          <colorPalette type="minMidMax" maxColor="#53A051" minColor="#FFFFFF"></colorPalette>
          <scale type="minMidMax"></scale>
        </format>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <title>DDoS by bandwidth</title>
      <chart>
        <title>index=ava_ss_firewall $ip_token$ | timechart  sum(bytes) AS bytes BY dest_ip | eval megabytes=((bytes/1024)/1024) | eval megabytes=round(megabytes,2) | sort - count</title>
        <search>
          <query>index=ava_ss_firewall $ip_token$ | timechart  sum(bytes) AS bytes BY dest_ip | eval megabytes=((bytes/1024)/1024) | eval megabytes=round(megabytes,2) | sort - count</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
        </search>
        <option name="charting.chart">column</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
  </row>
  <row>
    <panel>
      <title>instert ip to investigate HERE MANUALLY</title>
      <table>
        <title>| table user body dhost rule referer _time</title>
        <search>
          <query>instert ip to investigate HERE MANUALLY 
| table user body dhost rule referer _time</query>
          <earliest>$tkn_time.earliest$</earliest>
          <latest>$tkn_time.latest$</latest>
          <sampleRatio>1</sampleRatio>
        </search>
        <option name="count">10</option>
        <option name="dataOverlayMode">none</option>
        <option name="drilldown">none</option>
        <option name="percentagesRow">false</option>
        <option name="refresh.display">progressbar</option>
        <option name="rowNumbers">true</option>
        <option name="totalsRow">false</option>
        <option name="wrap">true</option>
      </table>
    </panel>
  </row>
</form>
